frontend/controllers/CommentController.php

	public function actionIndex(){
		//SELECT * FROM tbl_comment;
		$model = Comment::find()->all();
---
SELECT * FROM `tbl_comment`

	public function actionUpdate($id){
		$model = Comment::findOne($id);
		if(Yii::$app->request->post()){
			$model->load(Yii::$app->request->post());
			if($model->save()){
---
SELECT * FROM `tbl_comment` WHERE `id`='6'
UPDATE `tbl_comment` SET `message`='aku anak indonesia raya' WHERE `id`=6

	public function actionCreate(){
		$model = new Comment();
		//process form submit
		if (Yii::$app->request->post()){
			$model->load(Yii::$app->request->post());
			if ($model->save()) {
---
INSERT INTO `tbl_comment` (`name`, `message`) VALUES ('ria', 'ya allah hamba lelah')

	public function actionDelete($id){
		$model = Comment::findOne($id);
		$model->delete();
---
SELECT * FROM `tbl_comment` WHERE `id`='8'
DELETE FROM `tbl_comment` WHERE `id`=8